uncode-framework-ws/ws/soap_spring_cxf_wss4j/doc/inbound-1.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1">
            <wsse:UsernameToken wsu:Id="UsernameToken-a67bb246-b327-482c-a588-0eda911e1a62">
                <wsse:Username>client</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">clientpass</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body>
        <ns2:say xmlns:ns2="http://soap_spring_cxf_wss4j.ws.demo/">
            <arg0>world</arg0>
        </ns2:say>
    </soap:Body>
</soap:Envelope>